# Используем официальный образ Node.js версии 14 в качестве базового образа
FROM node:14

# Создаем и переходим в рабочую директорию для приложения
WORKDIR /app

# Копируем package.json и package-lock.json
COPY package*.json ./

# Устанавливаем зависимости приложения
RUN npm install

# Копируем все файлы приложения
COPY . .

# Собираем статические файлы для production
RUN npm run build

# Указываем порт, который будет использоваться в контейнере
EXPOSE 3000

# Запускаем приложение при запуске контейнера
CMD [ "npm", "start" ]
